---
kind: type
id: T:Autodesk.Revit.DB.Architecture.TreadNosingPosition
source: html/4eabcfcb-1df9-3eec-d78e-5306b3f712e2.htm
---
# Autodesk.Revit.DB.Architecture.TreadNosingPosition

Represents on which edges of the nosing to apply the nosing profile.

## Syntax (C#)
```csharp
public enum TreadNosingPosition
```